[
    {
        "code": "S01E01",
        "title": "1. The Good Son",
        "description": "Frasier sa po rozvode s Lilith vracia do rodného Seattle a snaží sa aklimatizovať v novom prostredí. V KACL veľa vecí pokazí, Roz je z neho nervózna, brat Niles sa mu sťažuje na otca a Martin sa sťahuje do Frasierovho bytu. Frasier mu nájde opatrovateľku Daphne."
    },
    {
        "code": "S01E02",
        "title": "2. Space Quest",
        "description": "Frasierovi sa nepáči, že Daphne zavádza v jeho byte nové móresy. Chce si prečítať nejakú zaujímavú knihu, ale stále ho niekto vyrušuje. S Martinom sa poháda, ale prizná sa, že je to asi dôsledok z rozvodu s Lilith."
    },
    {
        "code": "S01E03",
        "title": "3. Dinner at Eight",
        "description": "Niles sa spoznáva s Daphne. Večer Niles, Frasier a Martin sa vyberú do reštaurácie, ktorú Martin vybral. Ten je podráždený z ich snobského správania sa."
    },
    {
        "code": "S01E04",
        "title": "4. I Hate Frasier Crane",
        "description": "Frasiera cez médiá prenasleduje nejaký chlapík, ktorý ho nenávidí. Frasier chce spor vyriešiť diplomaticky, ale chlapík sa chce s ním stretnúť a vybaviť si to s ním ručne."
    },
    {
        "code": "S01E05",
        "title": "5. Here's Looking at You",
        "description": "Frasier kúpi Martinovi teleskop, aby si mohol krátiť čas pozorovaním okolia. Martin takto nájde nejakú ženu v mrakodrapde oproti, ktorá ho tiež pozoruje ďalekohľadom."
    },
    {
        "code": "S01E06",
        "title": "6. The Crucible",
        "description": "Frasier sa v KACL počas show chváli, že má doma obraz od nejakej známej maliarky. Ona mu zavolá do rádia a Frasier ju pozve na párty. Po príchode mu povie, že ten obraz nenamaľovala ona."
    },
    {
        "code": "S01E07",
        "title": "7. Call Me Irresponsible",
        "description": "Frasier počas show poradil nejakému Marcovi, aby ukončil neistý vzťah bez budúcnosti. Na druhý deň príde za ním rozčúlená Catherine, s ktorou sa Marco rozišiel. S Frasierom sa však spriatelí a dohodnú sa na rande."
    },
    {
        "code": "S01E08",
        "title": "8. Beloved Infidel",
        "description": "Frasier a Niles zistia, že Martin má rande so ženou, s ktorej rodinou Craneovci kedysi zle vychádzali. Majú podozrenie, že Martin podvádzal ich matku s tou ženou."
    },
    {
        "code": "S01E09",
        "title": "9. Selling Out",
        "description": "Frasierovi sa nepáči, že musí v rádiu čítať reklamy, ktoré sú proti jeho zásadám. Neskôr zisťuje, že ak získa dobré skúsenosti s produktmi, tak práca s reklamou nie je až taká zlá, najmä keď je dobre zaplatená."
    },
    {
        "code": "S01E10",
        "title": "10. Oops!",
        "description": "V KACL sa šíria klebety, že stanica prekročila rozpočet a budú musieť niekoho prepustiť. Bulldog sa na základe klebiet, ktoré rozšíril Frasier, dozvie, že tým prepusteným má byť vraj on. Bulldog sa naštve a ide si to s manažérom stanice vybaviť."
    },
    {
        "code": "S01E11",
        "title": "11. Death Becomes Him",
        "description": "Martin zanedbáva lekárske prehliadky. Neskôr sa s Frasierom dozvedia, že Martinov lekár nečakane zomrie. Keďže bol zhruba v rovnakom weku ako Frasier, Frasier začína byť posadnutý myšlienkou, ako je možné, že taký mladý lekár zomrel a začína mať obavy o svoje zdravie."
    },
    {
        "code": "S01E12",
        "title": "12. Miracle On Third Or Fourth Street",
        "description": "Ide čas Vianoc, Frasier má zlú náladu, pretože Lilith mu nechce do Seattle poslať syna Fredericka. Poháda sa s Martinom a rozhodne sa, že Vianoce radšej strávi v KACL, kde zoberie zmenu za Bulldoga. Roz je za to na neho naštvaná."
    },
    {
        "code": "S01E13",
        "title": "13. Guess Who's Coming to Breakfast?",
        "description": "Martin má rande s nejakou Elaine. Elaine, bez toho aby Frasier o tom vedel, u nich prespí. Na druhý deň v show v KACL vyrozpárva do éteru \"románik\" medzi Martinom a Elaine. Obaja sa za to na neho naštvú."
    },
    {
        "code": "S01E14",
        "title": "14. Can't Buy Me Love",
        "description": "Frasier má dohovorené rande s nejakou Kristinou. Kristina k nemu domov dovedie svoju dcéru Renatu, pretože si musí niečo vybaviť a poprosí Frasiera aby na ňu za ten čas dozrel. Frasierovi sa to nepáči, o to horšie, že s Renatou si moc nesadli."
    },
    {
        "code": "S01E15",
        "title": "15. You Can't Tell a Crook By His Cover",
        "description": "Martin sa staví s Frasierom, že nedokáže určiť, ktorý z jeho priateľov, s ktorými občas hráva poker, je bývalý kriminálnik. Frasier sa na to odhodlá a stavia sa o 10 dolárov, že na základe psychoanalýzy dokáže kriminálnika odhaliť."
    },
    {
        "code": "S01E16",
        "title": "16. The Show Where Lilith Comes Back",
        "description": "Lilith, bývalá Frasierova žena, navštívi Seattle. Prizná sa mu, že sa rozhodla ho navštíviť kvôli listu na rozlúčku, ktorý jej zanechal. Frasier jej povie, že ten list jej písal pred vyše rokom."
    },
    {
        "code": "S01E17",
        "title": "17. A Mid-Winter Night's Dream",
        "description": "Daphne začne randiť s nejakým Ericom, Nilesovi sa to nepáči. Je na tom psychicky zle, prežíva s Maris manželskú krízu. Maris odcestovala niekam preč, aby porozmýšľala nad ich manželstvom, na to sa Daphne ponúkne Nilesovi, že pôjde k nemu domov, aby mu uvarila niečo dobré na večeru, s čím by mohol odohnať smútok."
    },
    {
        "code": "S01E18",
        "title": "18. And the Whimper Is...",
        "description": "Frasier a Roz boli nominovaní na cenu Seattle Broadcasting, ktorá sa udeľuje raz za rok za najlepšiu show. Frasier s Roz rozmýšľajú, ako by si naklonili porotu, aby získali cenu."
    },
    {
        "code": "S01E19",
        "title": "19. Give Him the Chair!",
        "description": "Frasier sa chce zbaviť starého Martinovho kresla a spolu s Nilesom mu kúpia nové moderné kreslo. Martinovi sa však nepáči a chce naspäť svoje staré kreslo. To sa však medzitým už vyhodilo ku kontajnerom."
    },
    {
        "code": "S01E20",
        "title": "20. Fortysomething",
        "description": "Frasier sa nevie zmieriť s tým, že je už mužom v strednom veku. V jednom obchode sa spozná s Carrie, ktorá by mu mohla byť dcérou. Carrie má o neho záujem, ale jemu prekáže veľký vekový rozdiel."
    },
    {
        "code": "S01E21",
        "title": "21. Travels With Martin",
        "description": "Craneovci rozmýšľajú, kam pôjdu na dovolenku. Martin nakoniec vymyslí, že pôjdu karavanom naprieč Amerikou. Cestou Daphne zaspí a zobudí sa až v Kanade. Zhrozí sa, pretože ešte nemá zelenú kartu a nesmie opustiť územie USA."
    },
    {
        "code": "S01E22",
        "title": "22. Author, Author",
        "description": "Niles má problémy so svojím vydavateľom, pre ktorého píše knihu. Ešte nič nenapísal, tak Frasier sa mu ponúkne, že mu s tým pomôže. Nejde to však vôbec tak ľahko ako si mysleli."
    },
    {
        "code": "S01E23",
        "title": "23. Frasier Crane's Day Off ",
        "description": "Frasier má chrípku a je príliš slabý na to, aby mohol moderovať svoju show. Dostane nápad, že Niles by ho na nejaký čas mohol zastúpiť. Neskôr sa mu sníva, že Niles mu chce jeho show \"ukradnúť\"."
    },
    {
        "code": "S01E24",
        "title": "24. My Coffee With Niles",
        "description": "Už je tomu rok, čo sa Frasier vrátil do Seattle. Spolu s Nilesom si vyjdú na kávu. Rozprávajú sa o Daphne, Martinovi a Roz. Niles sa spýta Frasiera, či je šťastný. Ten mu nevie odpovedať."
    },
    {
        "code": "S02E01",
        "title": "1. Slow Tango in South Seattle",
        "description": "V Seattle vyšiel nový knižný bestseller s názvom Pomalé tango v južnom Seattle. Autorom je jeho jeden starý známy z Bostonu, ktorého nemal príliš rád. Čo je horšie, v knihe sa dočíta, že autor zakomponoval jeho jeden milostný zážitok do deja knihy."
    },
    {
        "code": "S02E02",
        "title": "2. The Unkindest Cut of All",
        "description": "Eddie sa postaral o to, že má potomkov, Frasier nechce mať doma ďalších psov a rozhodne sa psíkov podarovať a Eddieho dať vykastrovať aby sa to už nikdy nezopakovalo. Martin je však zásadne proti."
    },
    {
        "code": "S02E03",
        "title": "3. The Matchmaker",
        "description": "V KACL majú nového manažéra. Frasier ho pozve k sebe domov, lebo ho chce dohodiť Daphne, ktorá už dlho s nikým nechodila. Manažér je však gay a pozvanie od Frasiera si vysvetlí po svojom."
    },
    {
        "code": "S02E04",
        "title": "4. Flour Child",
        "description": "Niles si začína robiť starosti, či sa niekedy stane otcom, s Maris o tom nehovoril a necíti sa byť na to pripravený. Zoberie si vrecko múky a pokúsi sa či dokáže naň dávať taký pozor, ako keby to bolo dieťa."
    },
    {
        "code": "S02E05",
        "title": "5. Dukes, We Hardly Knew Ye",
        "description": "Niles nahovorí Frasiera, aby investoval do nehnuteľností, ktoré sa majú stavať na istom pozemku. Netušia, že na tom pozemku sa nachádza bar U Dukeho, kam Martin rád chodieva."
    },
    {
        "code": "S02E06",
        "title": "6. The Botched Language of Cranes",
        "description": "Frasier počas show v KACL dá radu jednej poslucháčke, ktorá má nejaké problémy, aby opustila upršaný, ponurý a depresívny Seattle. Krátko na to mu začínajú vyvolávať naštvaní ľudia, prečo sa tak zle vyjadruje o ich meste."
    },
    {
        "code": "S02E07",
        "title": "7. The Candidate",
        "description": "Frasier sa rozhodne zúčastniť istej predvolebnej kampane. Podporí kandidáta, ktorý je v opozícii voči kandidátovi, ktorého podporuje Martin. Frasier je zanietený v kampani, ale všetko sa zmení, keď sa jeho kandidát prizná, že ho kedysi uniesli mimozemšťania."
    },
    {
        "code": "S02E08",
        "title": "8. Adventures In Paradise (Part 1)",
        "description": "Frasier sa zoznámi s Madeline, ktorú uvidel v časopise o Seattle v rubrike 100. najpríťažlivejších ľudí v Seattle. Spolu odchádzajú na dovolenku na ostrov Bora Bora, ale ubytujú ich hneď vedľa chaty, kde dovolenkuje Lilith."
    },
    {
        "code": "S02E09",
        "title": "9. Adventures In Paradise (Part 2)",
        "description": "Frasier po incidente na Bora Bora sa snaží vyžehliť si vzťah s Madeline. Všetko sa zdá, že nakoniec dopadne dobre, pokým sa do toho zase nezamieša Lilith."
    },
    {
        "code": "S02E10",
        "title": "10. Burying a Grudge",
        "description": "Maris je v nemocnici. Keď ju boli všetci pozrieť, tak Frasier si všimol, že vo vedľajšej izbe leží Martinov bývalý kolega Artie, s ktorým sa Martin kedysi veľmi pohádal. Chce od Martina, aby ich kamarátsky vzťah dal do poriadku."
    },
    {
        "code": "S02E11",
        "title": "11. Seat of Power",
        "description": "Martin chce od Frasiera, aby opravil tečúci záchod. Frasier radšej na to zavolá inštalatéra, Niles zisťuje, že je to ich bývalý spolužiak, ktorý Nilesa kedysi šikanoval."
    },
    {
        "code": "S02E12",
        "title": "12. Roz In the Doghouse",
        "description": "Bulldog sa začne viac zaujímať o Roz, tej to lichotí, ale Frasier ju varuje, že mu ide iba o jedno. Roz si však myslí, že Frasier iba žiarli, že Bulldog má o ňu záujem. Pohádajú sa a Roz sa rozhodne v KACL spolupracovať s Bulldogom. Frasier prišiel o svoju asistentku."
    },
    {
        "code": "S02E13",
        "title": "13. Retirement Is Murder",
        "description": "Martin rieši záhadu jednej niekoľkoročnej vraždy, ktorú doteraz nikto nevyriešil. Frasier sa mu rozhodne s tým pomôcť."
    },
    {
        "code": "S02E14",
        "title": "14. Fool Me Once, Shame On You...",
        "description": "Frasier v Nervose zistí, že mu ukradli tašku. Čo je horšie, zlodej mu s vecami ukradol aj jeho identitu a teraz sa vydáva za neho."
    },
    {
        "code": "S02E15",
        "title": "15. You Scratch My Book...",
        "description": "Daphne číta knihu od nejakej doktorky Honey Snow, Frasierovi sa jej diela nepáčia. Zmení názor, keď sa s ňou zoznámi osobne. Niles medzitým zaúča Daphne, ako investovať do akcií."
    },
    {
        "code": "S02E16",
        "title": "16. The Show Where Sam Shows Up",
        "description": "Seattle navštívi Frasierov starý známy, barman Sam z Bostonu. Spomína, že sa mal oženiť so Sheilou, ich spoločnou známou. Frasier zisťuje, že so Sheilou kedysi prežil noc a Sam o tom nevie."
    },
    {
        "code": "S02E17",
        "title": "\n17. Daphne's Room\r\nFrasier hľadá nejakú knihu, Martin mu povie, že si ju požičala Daphne. Ide si po knihu do jej izby, keď ho tam Daphne prichytí ako si obzerá jej veci. Veľmi sa na neho naštve.\r\n",
        "description": ""
    },
    {
        "code": "S02E18",
        "title": "19. Someone to Watch Over Me",
        "description": "Blíži sa druhé výročie odovzdávania cien SeaBea. Frasier sa teší, ale náladu mu kazí tajná obdivovateľka, ktorá sa zdá, že je ním posadnutá."
    },
    {
        "code": "S02E19",
        "title": "20. Breaking the Ice",
        "description": "Martin sa chystá s Dukem na rybačku. Dukeho však seklo v krížoch, tak sa mu ponúkne Niles, že s ním pôjde, aby spravil dojem na Daphne. Pridá sa aj Frasier, ktorý má pocit, že Martin ho má rád menej, ako by si želal."
    },
    {
        "code": "S02E20",
        "title": "21. An Affair to Forget",
        "description": "Frasierovi do show volá nejaká Gretchen, ktorej muž, učiteľ šermu, trávi akosi príliš veľa času s jednou z jeho žiačiek. Frasier zisťuje, že tou žiačkou je Maris. Nevie ako to má povedať Nilesovi."
    },
    {
        "code": "S02E21",
        "title": "22. Agents In America Part III",
        "description": "V KACL sa majú podpisovať nové zmluvy. Frasierova agentka Bebe mu chce vybaviť oveľa lepšiu zmluvu, než akú mal doteraz a použije pri tom nekonvenčné prostriedky, ktoré sa Frasierovi vôbec nepáčia."
    },
    {
        "code": "S02E22",
        "title": "23. The Innkeepers",
        "description": "Frasier a Niles sa rozhodnú, že kúpia reštauráciu, ktorá sa bude rušiť. Počas prvej večere im ujdú všetci kuchári kvôli nejakému incidentu a musia večere pre hostí dovariť sami."
    },
    {
        "code": "S02E23",
        "title": "24. Dark Victory",
        "description": "Niles je naštvaný na Frasiera, že mu \"ukradol\" pacientku. Roz sa cíti osamelo a cnie sa jej za rodným Wisconsinom. Martin má narodeniny a s Daphne sa ako obvykle pohádajú. Do toho vypadne prúd v celom južnom Seattle."
    },
    {
        "code": "S03E01",
        "title": "1. She's the Boss",
        "description": "V KACL majú novú manažérku. Tá si s Frasierom nepadne do oka a začne medzi nimi konflikt, kto viac vydrží vzdorovať tomu druhému. Frasier si pre svoju show \"vybaví\" nočný vysielací čas."
    },
    {
        "code": "S03E02",
        "title": "2. Shrink Rap",
        "description": "Frasier a Niles sedia u nejakého psychiatra, ktorý sa špecializuje na terapiu dvojíc. Má vyriešiť konflikt medzi Frasierom a Nilesom, ktorí medzi sebou večne súťažia."
    },
    {
        "code": "S03E03",
        "title": "3. Martin Does It His Way",
        "description": "Frasier je poverený zorganizovať pohreb neobľúbenej tety Louise, ktorá si Frasiera obľúbila. Tomu sa príliš do toho nechce, najmä keď si má napísať pohrebnú reč. Martin posiela Frankovi Sinatrovi texte piesne, ktorú kedysi napísal pre svoju ženu Hester."
    },
    {
        "code": "S03E04",
        "title": "4. Leapin' Lizards",
        "description": "Bulldog si stále robí srandu z Frasiera, ten je už z neho nervózny a rozmýšľa, ako mu v tom zabrániť. Prichystá na neho pascu, ale chytí sa do nej niekto úplne iný."
    },
    {
        "code": "S03E05",
        "title": "5. Kisses Sweeter Than Wine",
        "description": "Frasier bude doma organizovať ochutnávku vína, ktorej sa zúčastní niekoľko známych osobností. Preto treba aspoň na jeden deň presťahovať Martinovo kreslo mimo obývačky. Počas sťahovania Nilesovi vypadne z rúk a na parketách sa spraví ryha. Udalosti naberú rýchly spád."
    },
    {
        "code": "S03E06",
        "title": "6. Sleeping With the Enemy",
        "description": "Manažérka Kate zrušila zvýšenie platov v KACL. Zamestnanci rádia chcú štrajkovať a Frasiera si zvolia za svojho hovorcu. Tomu sa do toho príliš nechce, aj kvôli tomu, že s Kate nevychádza dobre."
    },
    {
        "code": "S03E07",
        "title": "7. The Adventures of Bad Boy and Dirty Girl",
        "description": "Manažérka Kate chce, aby Frasier s Roz zastúpili kolegu v jeho nočnej show. V závere show Frasier pustí unavenú Roz skôr domov, po jej odchode príde Kate za Frasierom. K niečomu medzi nimi dôjde, nevšimnú si však, že sú stále v éteri..."
    },
    {
        "code": "S03E08",
        "title": "8. The Last Time I Saw Maris",
        "description": "Maris je 3 dni nezvestná a Niles sa o ňu veľmi obáva. Neskôr sa dozvie, že bola na nákupoch. Niles jej vytmaví jej arogantné správanie, ona ho za to vyhodí z domu."
    },
    {
        "code": "S03E09",
        "title": "9. Frasier Grinch",
        "description": "Blížia sa Vianoce, Frasier nemá dobrú náladu. Prekáža mu Martinova nevkusná vianočná výzdoba a stále nemá pre syna Fredericka vhodný darček."
    },
    {
        "code": "S03E10",
        "title": "10. It's Hard to Say Goodbye if You Won't Leave",
        "description": "Frasier nemôže prestať myslieť na Kate od noci, keď k niečomu medzi nimi došlo počas nočnej show. Dohodne sa na rande s inou ženou z KACL, ale stále ho to ťahá ku Kate. Tá mu povie, že odchádza do Chicaga."
    },
    {
        "code": "S03E11",
        "title": "11. The Friend",
        "description": "Martin vyčíta Frasierovi, že nemá žiadnych priateľov, iba Nilesa. Frasier sa zatne a nájde si cez rádio nového priateľa. Stretnú sa v Nervose a tam zistí, že jeho nový priateľ je na invalidnom vozíku."
    },
    {
        "code": "S03E12",
        "title": "12. Come Lie With Me",
        "description": "Frasierovi sa nepáči, že Daphne spáva pod jeho strechou so svojím priateľom. Daphne sa rozhodne odsťahovať. Frasier zistí, že bez nej to nepôjde."
    },
    {
        "code": "S03E13",
        "title": "13. Moon Dance",
        "description": "Frasier odchádza na dovolenku. Niles sa chystá na bál, ale prizná sa, že nevie tancovať. Daphne sa podujme, že ho to naučí."
    },
    {
        "code": "S03E14",
        "title": "14. The Show Where Diane Comes Back",
        "description": "Do Seattle prichádza Diane, ktorá kedysi chodila s Frasierom, keď ešte žil v Bostone. Nechala ho a ten rozchod veľmi zle prežíval. V Seattle má mať generálku nejakej svojej hry a potrebuje od Frasiera pomoc."
    },
    {
        "code": "S03E15",
        "title": "15. A Word to the Wiseguy",
        "description": "Maris sa dostala do nejakých problémov. Roz Frasierovi a Nilesovi odporučí nejakého Jeromeho, ktorý dokáže vyriešiť každý problém. Frasier a Niles si o ňom myslia, že je mafián. Ten za vyriešenie problému chce od Frasiera malú službičku."
    },
    {
        "code": "S03E16",
        "title": "16. Look Before You Leap",
        "description": "Frasier má radosť z toho, že 29. februára je vonku 28 stupňov. Martin sa chystá na narodeninovú párty jedného kamaráta, ktorý žije v Montane, ale lietadlo takmer havaruje. Nilesovi začína chýbať Maris. Roz opäť nevyjde rande a Daphne zle dopadne u kaderníka."
    },
    {
        "code": "S03E17",
        "title": "17. High Crane Drifter",
        "description": "Frasier je už unavený z nezdvorilých ľudí. V Nervose, keď mu nejaký chlapík drzo obsadí stôl, naštve sa a vyhodí ho. Zrazu je hrdinom a vzorom pre celý Seattle."
    },
    {
        "code": "S03E18",
        "title": "18. Chess Pains",
        "description": "Frasier si zohnal vzácnu šachovnicu, ale nikto s ním nechce hrať. Nakoniec prehovorí Martina, ale ten ho porazí. Frasierovi sa nepodarí vyhrať ani v odvete a začína byť posadnutý myšlienkou ako poraziť Martina."
    },
    {
        "code": "S03E19",
        "title": "19. Crane vs. Crane",
        "description": "Syn známeho milionára požiada Nilesa, aby ho na súde obhajoval v spore s jeho otcom, ktorého považuje za senilného a nespôsobilého riadiť majetky. Frasier sa stretne s dotyčným milionárom a myslí si, že sa len trochu excentricky správa. Rozhodne sa ho na súde obhajovať, čím sa dostane do sporu s Nilesom."
    },
    {
        "code": "S03E20",
        "title": "20. Police Story",
        "description": "Frasiera zastaví policajná kontrola. Kontroluje ho príťažlivá policajtka a neskôr doma Frasier chce od Martina, aby mu zistil kto to bol. Martin zistí, že ide o Maureen a chodieva do baru k McGintymu. Stretnú sa v bare, ale policajtke sa zapáči Martin."
    },
    {
        "code": "S03E21",
        "title": "21. Where There's Smoke, There's Fired",
        "description": "KACL získal nový majiteľ. Frasier zisťuje, že Veľký Willy, ako si nový majiteľ hovorí, chodí s jeho agentkou Bebe. Willy chce od Frasiera, aby odnaučil Bebe fajčiť. Dáva mu na to 3 dni."
    },
    {
        "code": "S03E22",
        "title": "22. Frasier Loves Roz",
        "description": "Roz je zúfalá z toho, že stále nikoho nemá a rozhodne sa zbaliť prvého chlapa, ktorého stretne. Tým je nejaký Nilesov pacient menom Ben, ktorý je známy sukničkár. Fraserovi sa to nepáči a chce Roz ochrániť. Všetci si začnú myslieť, že žiarli na Bena a Roz chce pre seba."
    },
    {
        "code": "S03E23",
        "title": "23. The Focus Group",
        "description": "Roz a Frasier sledujú tajný prieskum, kde niekoľko náhodne vybraných ľudí kritizuje ich show. Kritika dopadne dobre, až na jedného muža, ktorý o Frasierovi povie, že ho nemá rád. Frasier chce za každú cenu zistiť, prečo ho nemá rád."
    },
    {
        "code": "S03E24",
        "title": "24. You Can Go Home Again",
        "description": "Už sú tomu 3 roky, čo Frasier a Roz spolupracujú. Tá mu podaruje kazetu s nahrávkou ich prvej show. Frasier si zaspomína na príchod do Seattle a svoje prvé trapasy."
    },
    {
        "code": "S04E01",
        "title": "1. The Two Mrs. Cranes",
        "description": "Daphne má navštíviť jej bývalý snúbenec Clive. Nie je tým nadšená a ani Niles nemá z toho dobrý pocit. Daphne predstaví bývalému snúbencovi Nilesa ako svojho manžela."
    },
    {
        "code": "S04E02",
        "title": "2. Love Bites Dog",
        "description": "Roz dohodne Frasierovi rande s nejakou Sharon. Rande prebieha dobre dovtedy, pokým sa na scéne neobjaví Bulldog a Sharon Frasierovi preberie."
    },
    {
        "code": "S04E03",
        "title": "3. The Impossible Dream",
        "description": "Frasier sa sťažuje, že v poslednej dobe nerieši žiadne zaujímavé psychologické prípady. Každú noc sa mu však sníva zvláštny sen, ktorý si nevie vysvetliť."
    },
    {
        "code": "S04E04",
        "title": "4. A Crane's Critique",
        "description": "Frasier a Niles sa čistou náhodou spoznajú s jedným známym spisovateľom, ktorý napísal jedinú knihu, ktorá sa stala bestsellerom. Spisovateľ si počas návštevy u Craneovcov u nich zabudne rukopis svojej novej knihy."
    },
    {
        "code": "S04E05",
        "title": "5. Head Game",
        "description": "Niles na istý čas zastupuje Frasiera v KACL. Bulldog ho zoznámi s jedným známym basketbalistom, ktorý bude mať interview počas Bulldogovej show. Basketbalista sa Nilesovi sťažuje, že v poslednej dobe má problémy s koncetráciou a chce od neho pomoc."
    },
    {
        "code": "S04E06",
        "title": "6. Mixed Doubles",
        "description": "Daphne sa rozíde so svojím priateľom. Niles ju chce pozvať na rande, ale Frasier ho požiada, aby aspoň jeden deň počkal. Na druhý deň sa dozvedia, že Daphne si medzitým niekoho našla. Niles je zúfalý."
    },
    {
        "code": "S04E07",
        "title": "7. A Lilith Thanksgiving",
        "description": "Frasier a Lilith chcú dostať syna Fredericka na jednu prestížnu akadémiu. Rozmýšľajú ako presvedčiť riaditeľa akadémie, že Frederick je tá najlepšia voľba."
    },
    {
        "code": "S04E08",
        "title": "8. Our Father Whose Art Ain't Heaven",
        "description": "Martin, Frasier a Niles idú do jednej reštaurácie. Frasier a Niles pokrytecky chvália jeden obraz len preto, aby sa zalíškali majiteľovi reštaurácie. Martin sa rozhodne, že ten obraz Frasierovi kúpi, nech má radosť."
    },
    {
        "code": "S04E09",
        "title": "9. Dad Loves Sherry, the Boys Just Whine",
        "description": "Martin si našiel novú priateľku Sherry. Frasierovi a Nilesovi sa vôbec nepáči jej excentrické správanie."
    },
    {
        "code": "S04E10",
        "title": "10. Liar! Liar!",
        "description": "Frasier a Niles sa priznajú Martinovi, že kedysi na škole spustili protipožiarny alarm, kvôli ktorému vylúčili ich spolužiaka. Vtedy klamali, že oni ho nespustili, aby ich nevylúčili. Martin je na nich naštvaný, že kvôli nim vylúčili nevinného žiaka."
    },
    {
        "code": "S04E11",
        "title": "11. Three Days of the Condo",
        "description": "Frasier si na vchodové dvere namontuje klopadlo. Slečna Langerová, vedúca domovskej rady, ho vyzve, aby ho dal preč. Frasier sa rozhodne postaviť sa jej a kandidovať proti nej vo voľbách do novej domovskej rady."
    },
    {
        "code": "S04E12",
        "title": "12. Death and the Dog",
        "description": "Eddie má nejaké problémy, v poslednej dobe je akýsi smutný. Martin mu chce zavolať zvieracieho psychiatra, Frasierovi a Nilesovi sa to zdá smiešne."
    },
    {
        "code": "S04E13",
        "title": "13. Four For the Seesaw",
        "description": "Frasier a Niles sa v Nervose zoznámia s dvomi ženami, ktoré pozvú na víkend na chatu. Niles má výčitky svedomia, nevie čo by na to povedala Maris."
    },
    {
        "code": "S04E14",
        "title": "14. To Kill a Talking Bird",
        "description": "Niles sa presťahoval do luxusného apartmánu. Chce pozvať nových susedov na zoznamovací večierok, problém je, že papagáj, ktorého chová doma, sa mu pazúrmi zakliesnil do hlavy a nechce sa pustiť."
    },
    {
        "code": "S04E15",
        "title": "\n15. Roz's Krantz and Gouldenstein Are Dead\r\nRoz spáchala dopravný priestupok, za ktorý si musí odpracovať verejnoprospešné práce. Chodí opatrovať ľudí do domova dôchodcov, všetci však postupne začnú zomierať a začnú si o Roz myslieť, že je Anjelom smrti.\r\n",
        "description": ""
    },
    {
        "code": "S04E16",
        "title": "17. Roz's Turn",
        "description": "Roz má šancu riadiť vlastnú show. Frasierovi sa nepáči, že príde o asistentku. Agentka Bebe si to vysvetlí po svojom a zariadi, aby Roz nevyhrala konkurz."
    },
    {
        "code": "S04E17",
        "title": "18. Ham Radio",
        "description": "Rádio KACL má 50. výročie. Na túto počesť chce Frasier režírovať detektívnu inscenáciu, ktorá sa bude naživo vysielať. Problémy sa objavia hneď na začiatku predstavenia."
    },
    {
        "code": "S04E18",
        "title": "19. Three Dates and a Break Up (Part 1)",
        "description": "Frasier si na jednej benefícii dohodne tri rande za sebou. Prvé mu nechtiac prekazia Martin a Sherry, ktorí sa neplánovane vrátia skôr domov. Na druhý deň sa Martin a Sherry tak pohádajú, až sa rozídu."
    },
    {
        "code": "S04E19",
        "title": "20. Three Dates and a Break Up (Part 2)",
        "description": "Frasier a Niles majú radosť z toho, že Martin sa rozišiel so Sherry. Neskôr si Sherry príde k Frasierovi vyzdvihnúť nejaké svoje veci a nechtiac mu prekazí aj druhé rande. Na druhý deň Sherry požiada Frasiera, aby sa o nej s Martinom porozprával."
    },
    {
        "code": "S04E20",
        "title": "21. Daphne Hates Sherry",
        "description": "Sherry a Daphne sa veľmi pohádajú. Daphne odchádza prenocovať k Nilesovi. Ten v tom vidí veľkú príležitosť, ako sa zblížiť."
    },
    {
        "code": "S04E21",
        "title": "22. Are You Being Served?",
        "description": "Maris sa chce rozviesť s Nilesom. Martin si prezerá nejaké svoje staré veci, Frasier v nich nájde denník ich matky, ktorá kedysi robila pokusy s \"Frasierom\" a \"Nilesom\"."
    },
    {
        "code": "S04E22",
        "title": "23. Ask Me No Questions",
        "description": "Niles sa pýta Frasiera, či si myslí, že on a Maris patria k sebe. Frasier mu nevie odpovedať, potrebuje čas na premyslenie. Po zvážení všetkých možností sa vyberie za Nilesom, aby mu povedal svoj názor. Všetko je však úplne inak."
    },
    {
        "code": "S04E23",
        "title": "24. Odd Man Out",
        "description": "Frasier nemá s kým ísť do reštaurácie. Na odkazovači si nájde odkaz od nejakej Laury, ktorá mu zrejme zavolala omylom v domnení, že volá svojej sestre. Frasier sa rozhodne využiť situáciu a ísť počkať Lauru na letisko."
    },
    {
        "code": "S05E01",
        "title": "1. Frasier's Imaginary Friend",
        "description": "Frasier letí do Mexika. V lietadle sa zoznámi so supermodelkou a vznikne medzi nimi vzťah. Doma mu však nikto neverí, že práve on zbalil nejakú supermodelku."
    },
    {
        "code": "S05E02",
        "title": "2. The Gift Horse",
        "description": "Martin má narodeniny. Niles a Frasier súťažia, kto z nich mu dá najlepší a najhodnotnejší darček."
    },
    {
        "code": "S05E03",
        "title": "3. Halloween",
        "description": "Roz sa Frasierovi prizná, že je asi tehotná. Počas halloweenskej párty Niles počuje o tehotenstve hovoriť Frasiera keď sa o tom baví s Daphne a myslí si, že tehotná je Daphne."
    },
    {
        "code": "S05E04",
        "title": "4. The Kid",
        "description": "Roz už vie naisto, že je tehotná. Frasier je prekvapený, že otec jej dieťaťa je od nej oveľa mladší. Sľúbi jej pomoc."
    },
    {
        "code": "S05E05",
        "title": "5. The 1000th Show",
        "description": "Frasier oslavuje svoju tisícu show. Manažér stanice zorganizuje oslavnú akciu priamo pod Vesmírnou ihlou, s názvom Deň Frasiera Cranea. Akcie sa zúčastní aj primátor Seattle."
    },
    {
        "code": "S05E06",
        "title": "6. Voyage of the Damned",
        "description": "Martin, Frasier, Niles a Roz sa zúčastnia jednej akcie, ktorá sa odohráva na palube lode. Niles na lodi stretáva Maris, hoci mala byť vo Švajčiarsku."
    },
    {
        "code": "S05E07",
        "title": "7. My Fair Frasier",
        "description": "Frasier sa v jednom obchode zoznamuje s právničkou Samanthou. Začnú spolu randiť a odmieta názory ostatných, že Samantha v ich vzťahu prebrala vedúcu úlohu."
    },
    {
        "code": "S05E08",
        "title": "8. Desperately Seeking Closure",
        "description": "Samantha sa rozchádza s Frasierom. Ten je z rozchodu sklamaný a za každú cenu chce vedieť, prečo ho nechala."
    },
    {
        "code": "S05E09",
        "title": "9. Perspectives On Christmas",
        "description": "Sú Vianoce. Martin má hrať v nejakej divadelnej vianočnej hre, ktorá sa skúša v miestnom kostole. Daphne si myslí, že sa blíži Martinova posledná hodina a preto začal chodiť do kostola."
    },
    {
        "code": "S05E10",
        "title": "10. Where Every Bloke Knows Your Name",
        "description": "Frasier dlho nemal žiadne rande a preto ho Daphne zoberie do jej obľúbenej krčmy, aby ho s niekým zoznámila. Frasierovi sa tam zapáči a rozhodne sa, že tam bude chodiť. Daphne sa to nepáči."
    },
    {
        "code": "S05E11",
        "title": "11. Ain't Nobody's Business if \"I Do\"",
        "description": "Daphne v bielizni objaví zásnubný prsteň. Všetci si myslia, že Martin chce požiadať Sherry o ruku."
    },
    {
        "code": "S05E12",
        "title": "12. The Zoo Story",
        "description": "V KACL sa budú prehodnocovať pracovné zmluvy. Frasier je pohádaný s Bebe a preto má nového agenta. Frasierovi nový agent navrhne, že k zvýšeniu platu mu pomôže zvýšenie popularity a preto by sa mal zúčastniť jednej akcie v miestnej ZOO, kde chcú jedného žeriava pomenovať podľa neho."
    },
    {
        "code": "S05E13",
        "title": "13. The Maris Counselor",
        "description": "Niles si chce s Maris spraviť pekný večer. So šokom zisťuje, že Maris ho podvádza s jej terapeutom. Rozhodne sa ju opustiť. Martin má mladú nápadníčku, ale neskôr sa dozvie, že ho chce dohodiť svojej matke."
    },
    {
        "code": "S05E14",
        "title": "14. The Ski Lodge",
        "description": "Craneovci spolu s Daphne a jej jednou kamarátkou idú na hory na lyže. Tam ich privíta lyžiarsky inštruktor, ktorému sa páči Niles. Každý tam začne baliť niekoho iného."
    },
    {
        "code": "S05E15",
        "title": "15. Room Service",
        "description": "Lilith je opäť v Seattle, jej aktuálny manžel Brian ju opustil. Frasier ju pozve na jednu recepciu. Niles ju potom odprevadí na hotel a skončia spolu v posteli."
    },
    {
        "code": "S05E16",
        "title": "16. Beware of Greeks",
        "description": "Craneovci sa chystajú na svadbu Frasierovho a Nilesovho bratranca Nikosa, ktorému Frasier raz zle poradil a ten zanechal nádejnú kariéru chirurga. Za to ho jeho teta Zora neznáša."
    },
    {
        "code": "S05E17",
        "title": "17. The Perfect Guy",
        "description": "V KACL majú nového kolegu. Vo všetkom je lepší ako Frasier, ten zúfalo na ňom hľadá aspoň jednu chybičku. Bulldog sa sťažuje, že mu preberá všetky ženy v KACL."
    },
    {
        "code": "S05E18",
        "title": "18. Bad Dog",
        "description": "V Nervose sa objaví ozbrojený lupič. Bulldog použije Roz ako živý terč, ale všetci si myslia, že ju chcel ochrániť. Iba Frasier vie ako to bolo naozaj. Bulldog sa však nemieni priznať."
    },
    {
        "code": "S05E19",
        "title": "19. Frasier Gotta Have It",
        "description": "Frasier má novú známosť Caitlin. Tá sa však správa excentricky a Frasier začína pochybovať, či to má budúcnosť."
    },
    {
        "code": "S05E20",
        "title": "20. First Date",
        "description": "Niles chce pozvať Daphne na rande, ale v rozhodujúcej chvíli sa zľakne. Vymyslí si, že chce na rande pozvať vlastne niekoho iného."
    },
    {
        "code": "S05E21",
        "title": "21. Roz and the Schnoz",
        "description": "Roz sa zoznamuje s rodičmi otca svojho dieťaťa. Zisťuje, že sú škaredí a obáva sa, že aj jej dieťa bude škaredé. Frasier daruje Daphne nejaké lacné náušnice, ona si myslí, že sú z pravého zafíru."
    },
    {
        "code": "S05E22",
        "title": "22. The Life of the Party",
        "description": "Frasier a Niles sa sťažujú, že nikoho nemajú. Martin im poradí, nech zorganizujú párty pre slobodných. Roz porodí dcéru Alice."
    },
    {
        "code": "S05E23",
        "title": "23. Party, Party",
        "description": "Frasier stále chodí neskoro na jedno rande s istou Triciou. Dohodne sa s ňou na ďalšom, bohužiaľ doma ho čaká narodeninová oslava a zároveň je pozvaný na párty do Safari klubu."
    },
    {
        "code": "S05E24",
        "title": "24. Sweet Dreams",
        "description": "Do KACL prichádza nový manažér. Tomu sa nepáči, že Frasier nechce čítať reklamy. Nakoniec uzná, že ho do toho nútiť nebude. Za to ho majiteľ stanice vyhodí. Frasier ide protestovať za majiteľom, ten mu povie, že mení formát stanice a namiesto KACL bude hudobné rádio Salsa. Frasier a ostatní moderátori sú prepustení."
    },
    {
        "code": "S06E01",
        "title": "1. Good Grief",
        "description": "Frasier je bez práce. Najprv je plný elánu z novej situácie, ale postupne upadá do depresie."
    },
    {
        "code": "S06E02",
        "title": "2. Frasier's Curse",
        "description": "Frasier si neúspešne hľadá nové zamestnanie. Chystá sa na stretávku z univerzity, ale váha, či sa tam má vôbec ukázať, keďže sa mu teraz v ničom nedarí."
    },
    {
        "code": "S06E03",
        "title": "3. Dial M for Martin",
        "description": "Frasier sa v poslednej dobe často háda s Martinom. Niles sa rozhodne, že si ho na nejaký čas zoberie k sebe, počíta s tým, že sa k nemu presťahuje aj Daphne. Tá ma však iné plány."
    },
    {
        "code": "S06E04",
        "title": "4. Hot Ticket",
        "description": "Niles a Frasier sa chystajú na operu. Zistia, že majú neplatné lístky a dostanú radu, aby sa postavili do rady pre vrátené lístky. Pre nich je to však veľmi ponižujúce."
    },
    {
        "code": "S06E05",
        "title": "5. First Do No Harm",
        "description": "Frasier sa zoznámil s Marie, Dukeho dcérou. Celkom si rozumejú až dovtedy, pokým si neuvedomí, že Marie je s ním preto, lebo jej dáva terapie zadarmo."
    },
    {
        "code": "S06E06",
        "title": "6. Secret Admirer",
        "description": "Frasier má novú vážnu známosť Nancy. Zrazu však začne dostávať darčeky od nejakej tajnej ctiteľky, rozhodne sa zistiť kto to je a začne hrať na dve strany."
    },
    {
        "code": "S06E07",
        "title": "7. How to Bury a Millionaire",
        "description": "Niles má veľké finančné problémy. Hoci sa nechce vzdať luxusu, Frasier ho nakoniec prehovorí, aby sa presťahoval do lacnejšieho bytu. Roz a Frasier si naďalej hľadajú nové zamestnanie."
    },
    {
        "code": "S06E08",
        "title": "8. The Seal Who Came to Dinner",
        "description": "Niles potrebuje zorganizovať párty pre členov gurmánskeho klubu. Nemá na to priestory, tak požiada o pomoc Frasiera. Nakoniec sa rozhodne využiť vilu na pláži, ktorá patrí Maris."
    },
    {
        "code": "S06E09",
        "title": "9. Roz, a Loan",
        "description": "Aj Roz má finančné problémy. Frasier jej požičia peniaze, ale nepáči sa mu, že ich nepremyslene míňa. Medzitým sa dozvedia, že Rádio Salsa nemá úspech a vráti sa k starému formátu."
    },
    {
        "code": "S06E10",
        "title": "10. Merry Christmas, Mrs. Moskowitz",
        "description": "Frasier sa zoznámi s Helen, ktorá mu dohodí svoju dcéru Faye. Frasier pozve Faye k sebe domov, kde práve prebieha vianočná výzdoba. Netuší, že Faye a Helen sú židovky."
    },
    {
        "code": "S06E11",
        "title": "11. Good Samaritan",
        "description": "Frasier sa snaží pomáhať rôznym ľuďom, ale zakaždým to skončí zle a on vyzerá ako idiot. Skúsi to ešte naposledy a zoberie autom ženu, ktorá mokne v daždi. Zo ženy sa vykľuje prostitútka."
    },
    {
        "code": "S06E12",
        "title": "12. Our Parents, Ourselves",
        "description": "Roz a Frasier sa dohodnú, že dajú dokopy Martina s Rozinou matkou Joannou. Všetko sa sprvu zdanlivo vyvíja dobre, ale Martin má už úplne iné plány."
    },
    {
        "code": "S06E13",
        "title": "13. The Show Where Woody Shows Up",
        "description": "Frasiera navštívi starý kamarát Woody z baru Cheers. Sprvu sa dobre bavia, ale neskôr sa Frasierovi prestáva páčiť, že Woody chce s ním byť každý deň."
    },
    {
        "code": "S06E14",
        "title": "14. Three Valentines",
        "description": "Je Valentín, Niles, Frasier a Martin ho chcú čo najlepšie využiť. Niles takmer spáli Frasierov byt, Frasier sa zoznámi s Cassandrou, ktorá mu dáva protichodné signály a Martin strávi večer s Daphne v reštaurácii."
    },
    {
        "code": "S06E15",
        "title": "15. To Tell the Truth",
        "description": "Niles sa sťažuje, že Maris sa snaží čo najviac oddialiť ich rozvod. Roz mu poradí dobrého právnika Donnyho."
    },
    {
        "code": "S06E16",
        "title": "16. Decoys",
        "description": "Donny a Daphne začali spolu chodiť. Niles je zúfalý a snaží sa dať dokopy Donnyho s Roz."
    },
    {
        "code": "S06E17",
        "title": "17. Dinner Party",
        "description": "Niles a Frasier sa rozhodnú, že zorganizujú večierok pre miestnych snobov. Plány sa im rúcajú hneď na začiatku."
    },
    {
        "code": "S06E18",
        "title": "18. Taps at the Montana",
        "description": "Niles sa chce vrátiť do svojho bytu v komplexe Montana. Jeho susedia však chcú prehodnotiť jeho nájomnú zmluvu, pretože podnájomník, ktorý býval v Nilesovom byte počas jeho neprítomnosti, robil veľký hluk."
    },
    {
        "code": "S06E19",
        "title": "19. IQ",
        "description": "Niles a Frasier sa zúčastnia jednej aukcie, kde obaja začnú súťažiť medzi sebou, kto zaplatí viac za večeru s nositeľmi Nobelovej ceny. Obaja vysoko prestrelia."
    },
    {
        "code": "S06E20",
        "title": "20. Dr. Nora",
        "description": "Frasierova show má úspech a stanica KACL uvažuje nad podobnou show. Frasier si na pohovore vyberie istú Dr. Noru, ktorej prístup sa mu veľmi pozdáva. Ako však začne vysielanie, Dr. Nora sa úplne zmení."
    },
    {
        "code": "S06E21",
        "title": "21. When a Man Loves Two Women",
        "description": "Frasier sa dal dokopy s Cassandrou, s ktorou sa zoznámil na Valentína. V Nervose sa stretáva s Faye, ktorá bola istý čas v Európe. Frasier nevie pre ktorú sa má rozhodnúť."
    },
    {
        "code": "S06E22",
        "title": "22. Visions of Daphne",
        "description": "Daphne má vízie v ohľade svojej svadby, tuší, že niečo je zle. Niles sa snaží situáciu využiť."
    },
    {
        "code": "S06E23",
        "title": "23. Shutout in Seattle (Part 1)",
        "description": "Niles prežíva krízu zo samoty. Všetci naokolo neho niekoho majú a on je sám. Od istého dňa prestane dvíhať telefón a nikto nevie čo je s ním."
    },
    {
        "code": "S06E24",
        "title": "24. Shutout in Seattle (Part 2)",
        "description": "Niles má novú známosť, ktorou si vynahrádza Daphne. Roz paktuje s Bulldogom, ktorého vyrazia z KACL. Frasier balansuje medzi Cassandrou a Faye, obáva sa situácie, keď sa tie dve spoznajú."
    },
    {
        "code": "S07E01",
        "title": "1. Momma Mia",
        "description": "Frasiera v Nervose zaujme istá žena menom Mia. Niečo ho na nej veľmi priťahuje a rozhodne sa s ňou zoznámiť."
    },
    {
        "code": "S07E02",
        "title": "2. Father of the Bride",
        "description": "Frasier sa nechtiac ponúkne Daphne, že jej zaplatí svadbu. Rozmýšľa, ako sa z ponuky vymotať tak, aby ju nesklamal."
    },
    {
        "code": "S07E03",
        "title": "3. Radio Wars",
        "description": "Z Frasiera si robia srandu kolegovia z KACL, keď mu vyvolávajú na telefón. Frasier sa rozhodne s nimi zatočiť po svojom."
    },
    {
        "code": "S07E04",
        "title": "4. Everyone's a Critic",
        "description": "Niles sa stal kritikom umenia pre prestížny magazín. Frasier nechce zostať pozadu a chce si zariadiť rozhlasovú show o kultúre."
    },
    {
        "code": "S07E05",
        "title": "5. The Dog that Rocks the Cradle",
        "description": "Roz si najme Bulldoga ako opatrovateľku pre dcéru Alice, aby mohla mať viac času pre seba. Bulldog sa však snaží prekaziť každé jej rande."
    },
    {
        "code": "S07E06",
        "title": "6. Rivals",
        "description": "Frasier a Niles si našli partnerky, ale obaja si myslia, že ten druhý chce prekaziť vzťah tomu prvému."
    },
    {
        "code": "S07E07",
        "title": "7. A Tsar is Born",
        "description": "Martin vlastní starožitné hodiny z čias cárskeho Ruska, ktoré kedysi patrili cárskej rodine. Frasier a Niles sú vo vytržení, že majú šľachtický pôvod."
    },
    {
        "code": "S07E08",
        "title": "8. The Late Dr. Crane",
        "description": "Frasier kvôli Nilesovi si počas ľahkej havárie autom rozbije nos. V nemocnici ho omylom vyhlásia za mŕtveho. Niles sa zoznámi s Marisinou plastickou chirurgičkou - Mel. Je ňou očarený."
    },
    {
        "code": "S07E09",
        "title": "9. The Apparent Trap",
        "description": "Lilith prišla s Frederickom na Deň vďakyvzdania do Seattle. Frederickovi veľmi záleží na tom, aby sa Lilith dala s Frasierom opäť dokopy."
    },
    {
        "code": "S07E10",
        "title": "10. Back Talk",
        "description": "Frasier má narodeniny, ale neužije si ich, pretože ho veľmi bolí chrbát. Zoberie si viac liekov proti bolesti, ktoré ho omámia a nechtiac vyzradí Daphne veľké tajomstvo o Nilesovi."
    },
    {
        "code": "S07E11",
        "title": "11. The Fight Before Christmas",
        "description": "Frasier doma organizuje predvianočný večierok. Mel sa dozvie, že Niles bol s Maris."
    },
    {
        "code": "S07E12",
        "title": "12. RDWRER",
        "description": "Craneovci idú na výlet karavanom, chcú netradične osláviť Nový rok. Zastavia sa v jednom motoreste, Niles však nechtiac nastúpi do cudzieho karavanu."
    },
    {
        "code": "S07E13",
        "title": "13. They're Playing Our Song",
        "description": "Kenny chce od Frasiera, aby si k show vymyslel nejakú hudobnú zvučku. Frasier to zoberie smrteľne vážne a dôkladne sa pripraví."
    },
    {
        "code": "S07E14",
        "title": "14. Big Crane on Campus",
        "description": "Frasier začne chodiť s Lornou, bývalou, veľmi populárnou, spolužiačkou. Je hrdý čo dosiahol, čoskoro však zistí, že o Lorne mal najmä len ilúzie."
    },
    {
        "code": "S07E15",
        "title": "15. Out with Dad",
        "description": "Je Valentín, Frasier je nespokojný, že je sám. Zoberie Martina do opery, kde sa chce zoznámiť s jednou ženou. Zoznámi sa aj Martin, ale úplne inak."
    },
    {
        "code": "S07E16",
        "title": "16. Something About Dr. Mary",
        "description": "Roz ide na dovolenku, tak Frasier dostane novú asistentku. Tá kompletne preberie jeho show."
    },
    {
        "code": "S07E17",
        "title": "17. Whine Club",
        "description": "Niles má podporiť Frasiera vo voľbe nového Korok majstra vo Vínovom klube. Mel presvedčí Nilesa, aby kandidoval aj on."
    },
    {
        "code": "S07E18",
        "title": "18. Hot Pursuit",
        "description": "Frasier a Roz idú na nejakú konferenciu, kde sa neplánovane zblížia. Donny má pre Martina kšeft, s ktorým Niles nesúhlasí."
    },
    {
        "code": "S07E19",
        "title": "19. Morning Becomes Entertainment",
        "description": "Frasierovi a Roz končí zmluva s KACL. Bebe má pre Frasiera novú ponuku - televíznu show."
    },
    {
        "code": "S07E20",
        "title": "20. To Thine Old Self Be True",
        "description": "Frasier sa ponúkne Donnymu, že mu zorganizuje rozlúčku so slobodou. Martin vybaví striptérku, ktorá pre Frasiera pripraví veľmi horúce chvíle."
    },
    {
        "code": "S08E01",
        "title": "1. And the Dish Ran Away with the Spoon (Part I)",
        "description": "Daphne a Niles spolu ušli z Daphninej svadby s Donnym. Ten to nechce nechať len tak a ani Mel sa nechce Nilesa len tak ľahko vzdať."
    },
    {
        "code": "S08E02",
        "title": "2. And the Dish Ran Away with the Spoon (Part II)",
        "description": "Niles a Daphne si chcú dať rande, ale Mel im všetko kazí. Daphne začína pochybovať, či bolo správne opustiť Donnyho."
    },
    {
        "code": "S08E03",
        "title": "3. The Bad Son",
        "description": "Frasier v autobuse spozná peknú ženu. Zistí, že pracuje v domove dôchodcov a využije Martina, aby sa dostal bližšie k nej. Daphne a Niles si spravili piknik na streche mrakodrapu."
    },
    {
        "code": "S08E04",
        "title": "4. The Great Crane Robbery",
        "description": "Stanica KACL má nového šéfa. Ten si hneď od začiatku rozumie s Frasierom a chce od neho aby ho naučil správaniu sa vo vysokej spoločnosti. Frasier je nadšený, ale len krátko..."
    },
    {
        "code": "S08E05",
        "title": "5. Taking Liberties",
        "description": "Frasier si najal komorníka, ako čiastočnú náhradu za Daphne. Niles už nevydrží spôsoby, ktorými ho vydiera Mel a na jednom večierku sa to rozhodne radikálne ukončiť."
    },
    {
        "code": "S08E06",
        "title": "6. Legal Tender Love and Care",
        "description": "Craneovci si najali právničku, ktorá ich má vysekať z problémov, ktoré im narobil Donny. Všetko sa však neplánované úplne zmení."
    },
    {
        "code": "S08E07",
        "title": "7. The New Friend",
        "description": "Roz má nového priateľa. Frasier sa s ním zoznámi a zistí, že si dobre rozumejú. Keď sa s Roz rozíde, tak Frasier jej sľúbi, že sa prestane s ním kamarátiť."
    },
    {
        "code": "S08E08",
        "title": "8. Mary Christmas",
        "description": "Frasier sa teší ako bude moderovať s jednou známou moderátorkou predvianočnú show v uliciach Seattle. Radosť ho však rýchlo prejde ako zbadá starú známu Dr. Mary."
    },
    {
        "code": "S08E09",
        "title": "9. Frasier's Edge",
        "description": "Frasier dostal cenu za celoživotné dielo. To, čo dosiahol, ho však tak zlomilo, že musí vyhľadať pomoc svojho profesora psychiatrie Dr. Tewkesburyho."
    },
    {
        "code": "S08E10",
        "title": "10. Cranes Unplugged",
        "description": "Do Seattle prišiel Frederick. Frasier sa na neho veľmi teší, ale Frederick, už nie je ten malý milý chlapček ako kedysi."
    },
    {
        "code": "S08E11",
        "title": "11. Motor Skills",
        "description": "Frasierovi sa pokazilo auto, ktoré si nevedel sám opraviť. Aby sa s Nilesom pred Martinom a Daphne ukázali, že sú k niečomu, rozhodli sa prihlásiť na kurzy pre automechanikov."
    },
    {
        "code": "S08E12",
        "title": "12. The Show Must Go Off",
        "description": "Frasier na jednej sci-fi akcii stretne známeho divadelného herca, ktorý ho v mladosti inšpiroval. Spolu s Nilesom ho chcú vrátiť na divadelné dosky, ale herec už nie je to, čo býval."
    },
    {
        "code": "S08E13",
        "title": "13. Sliding Frasiers",
        "description": "Frasier sa rozhoduje, či si oblečie na rande sako alebo sveter. V závislosti od toho, čo si oblečie, sa začne odvíjať jeho osud."
    },
    {
        "code": "S08E14",
        "title": "14. Hungry Heart",
        "description": "Kenny si dohodol rande s jednou ženou a s výčitkami svedomia si ide za Frasierom po pomoc. Frasier sa rozhodne, že pôjde na rande namiesto neho, to však dopadne úplne inak ako plánoval. Medzitým Daphne sa príliš veľa napcháva sladkosťami."
    },
    {
        "code": "S08E15",
        "title": "15. Hooping Cranes",
        "description": "Craneovci idú na basketbalový zápas. Niles vyhrá možnosť hodiť si loptou na kôš a ako hodí kôš, tak je z neho zrazu superhviezda. Sláva mu začne stúpať do hlavy."
    },
    {
        "code": "S08E16",
        "title": "16. Docu. Drama",
        "description": "Roz rozbieha vlastnú show o vesmíre. Frasier sa jej votrie do tímu s úmyslom pomôcť, ale problémy sa začnú čoskoro objavovať."
    },
    {
        "code": "S08E17",
        "title": "17. It Takes Two to Tangle",
        "description": "Frasierova a Nilesova bývalá škola vyhlásila bankrot. V snahe zachrániť ju, zúfalo hľadajú sponzorov. Martin sa zoznámi s veľmi bohatou ženou, Frasier a Niles to chcú využiť."
    },
    {
        "code": "S08E18",
        "title": "18. Forgotten But Not Gone",
        "description": "Niles sa opäť stal Korok majstrom vo Vínovom klube. Frasier sa rozhodne na svoje členstvo v klube abdikovať, bude mať svoju vlastnú show o víne v rádiu. Zároveň Martinovi chce najať novú opatrovateľku."
    },
    {
        "code": "S08E19",
        "title": "19. Daphne Returns",
        "description": "Daphne sa vracia z kúpeľov a spomenie, že chudnúť jej pomáhala nejaká tamojšia terapeutka. Niles nie je z toho nadšený. Frasier začína mať pocit, že si Niles Daphne príliš zidealizoval."
    },
    {
        "code": "S08E20",
        "title": "20. The Wizard and Roz",
        "description": "Frasierovi sa nepáči, že Dr. Tewkesbury a Roz majú k sebe bližšie ako by mali mať. Niles zase neverí Daphniným videniam. Zavolajú si špecialistu na médiá."
    },
    {
        "code": "S08E21",
        "title": "21. Semi-Decent Proposal",
        "description": "Frasier sa v obchode s elektronikou zoznámil s Claire, ihneď mu padla do oka. Lana, Frasierova bývalá partnerka a priateľka Claire mu sľúbi, že mu Claire dohodí, ale chce za to niečo."
    },
    {
        "code": "S08E22",
        "title": "22. A Passing Fancy",
        "description": "Frasier doučuje Laninho syna Kirbyho. Ak Kirby spraví skúšky, tak Lana odporučí Claire, aby začala chodiť s Frasierom. Všetko sa však začne postupne zamotávať."
    },
    {
        "code": "S08E23",
        "title": "23. A Day in May",
        "description": "Frasier \"pomáha\" Lane predať istý dom, Niles spolu s Daphne venčia Eddieho v parku a Martin sa zúčastní konania vo veci prepustenia z väzenia muža, ktorý kedysi Martina prepustil."
    },
    {
        "code": "S08E24",
        "title": "24. Cranes Go Caribbean",
        "description": "Frasier chce Claire pozvať na výlet do Belize. Daphne zbadá na stolíku letenky a myslí, si že Niles ju chce pozvať do Belize na ich prvé výročie."
    },
    {
        "code": "S09E01",
        "title": "1. Don Juan in Hell (Part I)",
        "description": "Frasier sa nevie rozhodnúť medzi Claire a Lanou. Nakoniec si uvedomí, že chce byť s Lanou a rozíde sa s Claire. Neočakávane sa však objaví Lanin bývalý manžel."
    },
    {
        "code": "S09E02",
        "title": "2. Don Juan in Hell (Part II)",
        "description": "Frasier sa ide zblázniť z toho, že sa mu nedarí nadviazať úspešný vzťah. Odchádza preč na chatu, kde chce byť sám, ale prízraky z minulosti ho nenechajú na pokoji."
    },
    {
        "code": "S09E03",
        "title": "3. The First Temptation of Daphne",
        "description": "Daphne má zlé tušenie, že do Nilesa sa zaľúbila jedna z jeho pacientiek a nedokáže odolať tomu, aby sa nepresvedčila kto to je. Martin sa vráti z rybačky a nechtiac donesie cvrčka, ktorý nedá spať Frasierovi."
    },
    {
        "code": "S09E04",
        "title": "4. The Return of Martin Crane",
        "description": "Martin má nastúpiť na nové pracovné miesto, bude pracovať ako strážnik. Ako sa chystá prvý krát do práce, tak sa mu vynárajú spomienky na posledný deň v predchádzajúcom zamestnaní, keď ho postrelili."
    },
    {
        "code": "S09E05",
        "title": "5. Love Stinks",
        "description": "Roz má nového priateľa Rogera, ktorý pracuje ako smetiar. Frasierovi zase lezie na nervy, že si o ňom v KACL myslia, že je snob, preto sa rozhodne doma usporiadať večierok. Medzi hosťami sa objaví aj Roz s Rogerom."
    },
    {
        "code": "S09E06",
        "title": "6. Room Full of Heroes",
        "description": "Je Halloween, doma u Frasiera sa všetci prezliekli do kostýmov svojich hrdinov a Frasier chce k tomu prispôsobiť hru, v ktorej ma každý na určité otázky odpovedať tak, ako by odpovedal ich hrdina. Niles príde oblečený ako Martin, čo sa nepáči Frasierovi."
    },
    {
        "code": "S09E07",
        "title": "7. Bla-Z-Boy",
        "description": "Martin býva u Frasiera už 8 rokov a Frasier je deprimovaný z toho, že nemá v podstate žiadny iný vzťah, okrem jeho vzťahu s otcom. Vyhrotené situácie na seba nenechajú dlho čakať."
    },
    {
        "code": "S09E08",
        "title": "8. The Two Hundredth Episode",
        "description": "Frasier práve odvysielal svoju 2000. show. Doma zistí, že mu chýba páska z 893. show a začína byť posadnutý tým, aby ju získal. Ozve sa mu muž, ktorý mu oznámi, že má nahrávku tej show. Frasier zistí, že ten muž je ním posadnutý."
    },
    {
        "code": "S09E09",
        "title": "9. Sharing Kirby",
        "description": "Kirby by sa rád zamestnal v KACL, Frasier je proti tomu, ale sľúbi mu, že mu pomôže nájsť vhodné zamestnanie. Medzitým Kirby pracuje u Nilesa pri upratovaní knižnice. Pre oboch získa veľkú cenu, keď sa dozvedia, že Kirby má dobré kontakty na majiteľa známej vínnej pivnice."
    },
    {
        "code": "S09E10",
        "title": "10. Junior Agent",
        "description": "Frasierova show klesá na popularite pod vplyvom inej novej show nejakého známeho doktora. Frasier chce viac investícií do reklamy a ide sa poradiť za Bebe. Tá ho prekvapujúco zverí svojej asistentke."
    },
    {
        "code": "S09E11",
        "title": "11. Bully for Martin",
        "description": "Frasierovi sa nepáči, že k Martinovi sa veľmi zle správa jeho nadriadený v práci. Rozhodne sa konať a stretne sa s majiteľom SBS, v ktorej Martin pracuje."
    },
    {
        "code": "S09E12",
        "title": "12. Mother Load (Part I)",
        "description": "Frasier má nejaké osobné problémy so susedom Camom Winstonom, ktoré postupne gradujú. Medzitým Niles požiada Daphne, aby sa k nemu nasťahovala. Všetko naruší príchod Daphninej matky Getrudy a brata Simona."
    },
    {
        "code": "S09E13",
        "title": "13. Mother Load (Part II)",
        "description": "Cam Winston zavesil na svoj balkón americkú vlajku, ktorou úplne zakryl Frasierovi výhľad z bytu. Ten má z toho bolehlav. Niles a Daphne cítia, že s Gertrude to budú mať ešte zložité."
    },
    {
        "code": "S09E14",
        "title": "14. Juvenilia",
        "description": "V záujme omladenia poslucháčskej základne Frasierovej show, Frasier pristúpi na zúčastnení sa interview so študentami istej strednej školy. Problémy nastanú, keď sa ho študenti začnú pýtať na jeho minulosť."
    },
    {
        "code": "S09E15",
        "title": "15. The Proposal",
        "description": "Niles sa rozhodne požiadať Daphne o ruku. Požiada Martina, aby na ten čas zobral Gertrude niekam von. Požiadanie o ruku sa však nečakane skomplikuje."
    },
    {
        "code": "S09E16",
        "title": "16. Wheels of Fortune",
        "description": "Frasiera navštívi Lilithin nevlastný brat Blaine Sternin. Frasier ho nemá rád, lebo je klamár a podvodník a chce, aby zmizol z jeho bytu. Blaine mu však tvrdí, že sa zmenil, Martin a Daphne mu uveria. Frasier zúri."
    },
    {
        "code": "S09E17",
        "title": "17. Three Blind Dates",
        "description": "Daphne, Niles, Roz a Martin rozmýšľajú ako nájsť Frasierovi nejakú partnerku. Snažia sa pre neho vybaviť rande, každé však dopadne úplne inak ako sa predpokladalo."
    },
    {
        "code": "S09E18",
        "title": "18. War of the Words",
        "description": "Frederick prišiel do Seattle, má sa zúčastniť súťaže v hláskovaní. Podarí sa mu zvíťaziť, ale neskôr je obvinený z podvodu, do ktorého sa zaplietol Frasier."
    },
    {
        "code": "S09E19",
        "title": "19. Deathtrap",
        "description": "Martin, Niles a Frasier sa prišli pozrieť do ich starého rodičovského domu, kde kedysi bývali. Frasier a Niles sa pozrú do svojej skrýše, čo mali pod dlážkou a objavia v nej ľudskú lebku. Rozhodnú sa záhadu vyriešiť."
    },
    {
        "code": "S09E20",
        "title": "20. The Love You Fake",
        "description": "Cam Winston a Frasier si stále nevedia prísť na meno. Martin a Camova matka Cora sa rozhodnú, že im \"pomôžu\" sa zbaviť toho ich nepriateľstva. Niles medzitým testuje nový vynález - Segway."
    },
    {
        "code": "S09E21",
        "title": "21. Cheerful Goodbyes",
        "description": "Craneovci prídu do Bostonu, majú sa zúčasniť istej konferencie. Na letisku sa stretnú s Cliffom, Frasierovym starým známym z baru Cheers, ktorý Frasier niekoľko rokov navštevoval. Cliff ich pozve na svoju rozlúčku."
    },
    {
        "code": "S09E22",
        "title": "22. Frasier Has Spokane",
        "description": "Frasier a Roz idú vysielať do 300 míľ vzdialenom Spokane, kde KACL prebrala miestne rádio. Miestni poslucháči však odmietnu jeho show. Roz sa medzitým rozišla s Rogerom."
    },
    {
        "code": "S09E23",
        "title": "23. The Guilt Trippers",
        "description": "Daphnina matka Gertrude sa nedokáže vyrovnať s tým, že ju manžel Harry opustil. Niles sa rozhodne ísť za ním do Manchestru. Frasier a Roz medzitým spáchali niečo, čo podľa Frasiera môže ohroziť ich priateľstvo."
    },
    {
        "code": "S09E24",
        "title": "24. Moons Over Seattle",
        "description": "Niles sa vrátil z Anglicka aj s Harrym. Stretnutie s Gertrude však dopadne úplne inak ako si predstavoval. Daphne povie Nilesovi, že sa chce za neho vydať."
    },
    {
        "code": "S10E01",
        "title": "1. The Ring Cycle",
        "description": "Niles a Daphne sa tajne zosobášili v Nevade. Po príchode do Seattle zisťujú, že to nebol práve najlepší nápad."
    },
    {
        "code": "S10E02",
        "title": "2. Enemy at the Gate",
        "description": "Frasier odmieta zaplatiť za parkovanie, pretože sa na parkovisku bol len otočiť. Strážnik ho však odmieta pustiť von. Frasier sa rozhodne, že bude protestovať."
    },
    {
        "code": "S10E03",
        "title": "3. Proxy Prexy",
        "description": "Frasier sa chce stať predsedom domovskej rady. Martin mu nedáva šance, lebo je u nájomníkov neobľúbený. Frasier však dostane nápad, aby kandidoval Martin."
    },
    {
        "code": "S10E04",
        "title": "4. Kissing Cousin",
        "description": "Roz navštívi jej otravná sesternica Jen. Frasierovi sa nepáči jej správanie. Čo je horšie, Daphne sa sťahuje k Nilesovi a Frasier s Martinom sa musia začať starať o seba sami."
    },
    {
        "code": "S10E05",
        "title": "5. Tales From the Crypt",
        "description": "Frasiera rozčuľuje Bulldog, ktorý si stále z neho robí žarty. Rozhodne sa mu pomstiť tak, že ho na smrť vydesí."
    },
    {
        "code": "S10E06",
        "title": "6. Star Mitzvah",
        "description": "Frasierov syn Frederick sa má zúčastniť obradu, počas ktorého dospeje. Frasier chce svoju reč predniesť v hebrejčine, to však ešte netuší, čo mu vyviedol Noel."
    },
    {
        "code": "S10E07",
        "title": "7. Bristle While You Work",
        "description": "Frasier a Martin hľadajú náhradu za Daphne. Martin si vyberie istú Trish, zastáva si ju pred Frasierom, ale čoskoro aj sám zistí, že Trish má od Daphne ďaleko. Medzitým Niles zistí, že má vážne zdravotné problémy."
    },
    {
        "code": "S10E08",
        "title": "8. Rooms with a View",
        "description": "Niles skončil v nemocnici. Všetci nervózne čakajú ako dopadne operácia a vynárajú sa im spomienky z minulosti."
    },
    {
        "code": "S10E09",
        "title": "9. Don't Go Breaking My Heart",
        "description": "Niles sa vrátil z nemocnice s novým životným elánom. Frasierovi začína chýbať \"starý Niles\", ale nechce sa s ním o ničom hádať, lebo dal sľub."
    },
    {
        "code": "S10E10",
        "title": "10. We Two Kings",
        "description": "Sú Vianoce, Frasier a Niles sa hádajú u koho ich oslávia. Martin nemá náladu na ich hádky a tak sa rozhodne, že na Vianoce pôjde do práce."
    },
    {
        "code": "S10E11",
        "title": "11. Door Jam",
        "description": "Frasier získal pozvánku do kúpeľov, ktorá pôvodne patrila susedovi Camovi Winstonovi. Spolu s Nilesom začnú byť posadnutí tým, aby sa dostali medzi členov Zlatého klubu klientov."
    },
    {
        "code": "S10E12",
        "title": "12. The Harassed",
        "description": "Do KACL nastúpi nová moderátorka Julia. S Frasierom sú hneď na nože, najmä keď si Julia Frasierovu reakciu na jej správanie vysvetlí ako sexuálne obťažovanie."
    },
    {
        "code": "S10E13",
        "title": "13. Lilith Needs a Favor",
        "description": "Lilith príde do Seattle, potrebuje od Frasiera jednu láskavosť. Frasier je jej žiadosťou zaskočený."
    },
    {
        "code": "S10E14",
        "title": "14. Daphne Does Dinner",
        "description": "Keď sa u Frasiera jeden večierok skončil katastrofou, Daphne chce od Nilesa, aby sa ďalší večierok konal u nich. Frasier sa urazí, že nechcú od neho žiadnu pomoc, ale všetko sa vzápätí skomplikuje."
    },
    {
        "code": "S10E15",
        "title": "15. Trophy Girlfriend",
        "description": "Niles už nechce s Frasierom hrávať squash, tak Frasier sa spozná s Chelsea, s ktorou začne hrávať. Zapáči sa mu, ale jej správanie mu začne pripomínať jeho prísneho telocvikára zo školy."
    },
    {
        "code": "S10E16",
        "title": "16. Fraternal Schwinns",
        "description": "Frasier sa má zúčastniť cyklistickej akcie na podporu boja proti AIDS. Problém je, že sa nevie bicyklovať a ani Niles nie je na tom o nič lepšie."
    },
    {
        "code": "S10E17",
        "title": "17. Kenny on the Couch",
        "description": "Kenny sa rozvádza, doľahne to na neho, Frasier mu ponúkne terapiu. Martin má však pre neho lepšiu terapiu, čo sa Frasierovi nepáči."
    },
    {
        "code": "S10E18",
        "title": "18. Roe to Perdition",
        "description": "Frasier a Niles nakupujú, ale nepáči sa im pridrahý kaviár. Od priekupníka z Ruska dostanú výhodnú ponuku výborného kaviáru. Problém nastane, keď zásielky skončia."
    },
    {
        "code": "S10E19",
        "title": "19. Some Assembly Required",
        "description": "Tím KACL pomohol istej rodine postaviť dom. Frasier aj po odovzdaní domu má v pláne chodiť radiť novým majiteľom ako si ho majú zariadiť."
    },
    {
        "code": "S10E20",
        "title": "20. Farewell, Nervosa",
        "description": "Nervosa si najala muzikanta, ktorý svojím hraním ruší Frasiera a Nilesa pri rozhovoroch. A keďže majiteľka sa ho nechce vzdať, tak sa rozhodnú Nervosu bojkotovať a nájsť si novú kaviareň."
    },
    {
        "code": "S10E21",
        "title": "21. The Devil and Dr. Phil",
        "description": "Frasier zoznámi Roz s Dr. Philom, zisťuje však, že jeho agentkou je Bebe, ktorá chce Frasiera opäť získať do svojich osídiel."
    },
    {
        "code": "S10E22",
        "title": "22. Fathers and Sons",
        "description": "Craneovcov navštívi istý Dr. Leland Barton, ktorý kedysi spolupracoval s Hester. Roz si všimne, že Barton sa svojím správaním veľmi podobá na Frasiera a Nilesa a myslí si, že je ich skutočným otcom. Martin začína mať pochybnosti."
    },
    {
        "code": "S10E23",
        "title": "23. Analyzed Kiss",
        "description": "Roz má možnosť získať miesto programovej riaditeľky v inej stanici. Medzitým medzi Frasierom a Juliou sa začína niečo vážnejšie diať."
    },
    {
        "code": "S10E24",
        "title": "24. A New Position for Roz",
        "description": "Roz sa chystá na nové miesto, ale nakoniec sa rozhodne zostať v KACL. Frasier a Julia začnú spolu chodiť, čo sa Roz nepáči a rozhodne sa predsa len opustiť KACL."
    },
    {
        "code": "S11E01",
        "title": "1. No Sex Please, We're Skittish",
        "description": "Niles a Daphne sa snažia o dieťa, Frasier pokračuje vo vzťahu s Juliou a Roz sa rozhodla, že zváži návrat do KACL."
    },
    {
        "code": "S11E02",
        "title": "2. A Man, a Plan, and a Gal: Julia",
        "description": "Frasier pozve Juliu k sebe domov, aby ju zoznámil s rodinou. Stretnutie však dopadne inak ako každý očakával."
    },
    {
        "code": "S11E03",
        "title": "3. The Doctor is Out",
        "description": "Frasier sa nedopatrením dostane do gay baru. Na druhý deň to vie celý Seattle. Pomôže mu to však dostať sa do vyšších kruhov."
    },
    {
        "code": "S11E04",
        "title": "4. The Babysitter",
        "description": "Frasier sa v kníhkupectve po rokoch stretne so svojou bývalou opatrovateľkou. Má o ňu záujem, ale záujem o ňu začne mať aj Martin."
    },
    {
        "code": "S11E05",
        "title": "5. The Placeholder",
        "description": "Roz chce silou mocou dohodiť Frasierovi jej známu Annu. Frasierovi sa do rande moc nechce, a keď nakoniec súhlasí objaví sa niekto, o koho má oveľa väčší záujem."
    },
    {
        "code": "S11E06",
        "title": "6. I'm Listening",
        "description": "Frasier si nechtiac vypočuje telefonát, ako Ronee volá s nejakým mužom. Chce to povedať Martinovi, ale nechce sa priznať, že odpočúval."
    },
    {
        "code": "S11E07",
        "title": "7. Maris Returns",
        "description": "Frasier si chce rozbehnuť súkromnú prax, Nilesa kontaktuje Maris, má problémy so svojím milencom a potrebuje pomôcť."
    },
    {
        "code": "S11E08",
        "title": "8. Murder Most Maris",
        "description": "Maris zavraždila svojho milenca starožitnou kušou. Niles sa okamžite stane stredobodom pozornosti novinárov, pretože tú kušu jej daroval práve on."
    },
    {
        "code": "S11E09",
        "title": "9. Guns N' Neuroses",
        "description": "Lilit prichádza do Seattle. Zhodou okolností sa stretne so svojou známou, ktorá sa neskôr stretne s Frasierom a vybaví mu rande - s Lilith."
    },
    {
        "code": "S11E10",
        "title": "10. Sea Bee Jeebies",
        "description": "Frasierovi prekáža ako Nilesovi stúpla popularita po jeho medializovanom incidente s Maris. Čo je horšie, slávnosť udeľovania cien za vysielnie v rádiu dopadne pre neho katastrofálne."
    },
    {
        "code": "S11E11",
        "title": "11. High Holidays",
        "description": "Frasier nie je nadšený z Frederickovej puberty, Niles sa chce pred Daphne vytiahnuť a Martin sa omylom nadroguje. Veselé Vianoce."
    },
    {
        "code": "S11E12",
        "title": "12. Frasier-Lite",
        "description": "Tím KACL sa zúčastní v súťaží s tímom z iného rádia, kto viac schudne. Z KACL najviac váži Frasier, tak má čo robiť, aby schudol."
    },
    {
        "code": "S11E13",
        "title": "13. The Ann Who Came To Dinner",
        "description": "Frasier pozabudol zaplatiť poistku za byt. Roz mu navrhne agentku Ann, s ktorou Frasier svojho času randil. Frasier nerád súhlasí, to najhoršie ho však ešte len čaká."
    },
    {
        "code": "S11E14",
        "title": "14. Freudian Sleep",
        "description": "Ronee a Martin idú na chatu. Chtiac nechtiac zoberú so sebou aj Frasiera, Nilesa a Daphne. Počas prvej noci sa každému prisnije sen, v ktorom na povrch vyplávajú ich obavy."
    },
    {
        "code": "S11E15",
        "title": "15. Caught in the Act",
        "description": "Frasier sa po rokoch stretáva so svojou bývalou prvou manželkou Nanette. Nanette ho chce opäť zbaliť, Frasier odoláva, ale je to čoraz ťažšie."
    },
    {
        "code": "S11E16",
        "title": "16. Boo! (a.k.a. I'm With Her)",
        "description": "Ronee a Martin sa bavia na Frasierovi, ako sa dokáže ľahko vyľakať. Frasier sa rozhodne Martinovi za to pomstiť, ale ho tak vyľaká, že Martina musia odviesť do nemocnice."
    },
    {
        "code": "S11E17",
        "title": "17. Coots and Ladders",
        "description": "Frasier spáchal ťažký zločin - počas návštevy u susedy jej ukradol medajlón. Čo je horšie, pocit pri tejto drobnej krádeži sa mu zapáčil. Od Nilesa však potrebuje pomoc."
    },
    {
        "code": "S11E18",
        "title": "18. Match Game",
        "description": "Frasier sa zoznámi s Charlotte, majiteľkou zoznamovacej kancelárie. Charlotte si zaumieni, že nájde Frasierovi partnerku, ale nič mu nevychádza."
    },
    {
        "code": "S11E19",
        "title": "19. Miss Right Now",
        "description": "Frasier myslí na Charlotte, ale nemá odvahu sa jej vyznať. Roz ho zoberie do baru, aby na ňu zabudol, tam sa zoznámi s istou Kim, ktorú pozve k sebe domov."
    },
    {
        "code": "S11E20",
        "title": "20. And Frasier Makes Three",
        "description": "Frasier začína Charlotte nadbiehať, ale v ceste mu stojí jej priateľ Frank. Keď už sa zdá, že sa mu podarí dosiahnuť cieľ, tak sa objaví jedna takmer neprekonateľná prekážka."
    },
    {
        "code": "S11E21",
        "title": "21. Detour",
        "description": "Frasier sa dal do kopy s Charlotte, ale tá mu čoskoro oznámi, že za 3 týždne odchádza do Chicaga. Frasier chce ten zvyšný čas využiť ako sa len dá."
    },
    {
        "code": "S11E22",
        "title": "22. Crock Tales",
        "description": "Frasier spomína na 11 uplynutých rokov, ktoré prežil v Seattle. Uvedomuje si, koľko sa toho zmenilo."
    },
    {
        "code": "S11E23",
        "title": "23. Goodnight, Seattle (Part 1)",
        "description": "Ronee a Martin sa sobášia, Frasier im organizuje svadbu a Eddie zožerie prsteň. Predstavy o úspešnom dni sa začínajú rúcať."
    },
    {
        "code": "S11E24",
        "title": "24. Goodnight, Seattle (Part 2)",
        "description": "Ronee a Martin sa zosobášili, Daphne a Nilesovi sa narodil syn. Roz sa stala novou manažérkou stanice a Frasier sa rozhodol, že tiež začne novú kapitolu v živote."
    }
]